program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp16, [1, ?, 513]> spectrogram) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"spectrogram", [1, 100, 513]}}), ("RangeDims", {{"spectrogram", [[1, 1], [10, 1000], [513, 513]]}})))] {
            tensor<int32, [4]> var_68 = const()[name = tensor<string, []>("op_68"), val = tensor<int32, [4]>([1, 1, -1, 513])];
            tensor<fp16, [1, 1, ?, 513]> input_1_cast_fp16 = reshape(shape = var_68, x = spectrogram)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [1]> input_3_axes_0 = const()[name = tensor<string, []>("input_3_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [513]> ref_enc_layernorm_weight_to_fp16 = const()[name = tensor<string, []>("ref_enc_layernorm_weight_to_fp16"), val = tensor<fp16, [513]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [513]> ref_enc_layernorm_bias_to_fp16 = const()[name = tensor<string, []>("ref_enc_layernorm_bias_to_fp16"), val = tensor<fp16, [513]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1216)))];
            tensor<fp16, []> var_10_to_fp16 = const()[name = tensor<string, []>("op_10_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, ?, 513]> input_3_cast_fp16 = layer_norm(axes = input_3_axes_0, beta = ref_enc_layernorm_bias_to_fp16, epsilon = var_10_to_fp16, gamma = ref_enc_layernorm_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_5_strides_0 = const()[name = tensor<string, []>("input_5_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_5_dilations_0 = const()[name = tensor<string, []>("input_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_5_groups_0 = const()[name = tensor<string, []>("input_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 1, 3, 3]> weight_3_to_fp16 = const()[name = tensor<string, []>("weight_3_to_fp16"), val = tensor<fp16, [32, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2368)))];
            tensor<fp16, [32]> ref_enc_convs_0_bias_to_fp16 = const()[name = tensor<string, []>("ref_enc_convs_0_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3008)))];
            tensor<fp16, [1, 32, ?, 257]> input_5_cast_fp16 = conv(bias = ref_enc_convs_0_bias_to_fp16, dilations = input_5_dilations_0, groups = input_5_groups_0, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = input_5_strides_0, weight = weight_3_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [1, 32, ?, 257]> input_7_cast_fp16 = relu(x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> weight_5_to_fp16 = const()[name = tensor<string, []>("weight_5_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3136)))];
            tensor<fp16, [32]> ref_enc_convs_1_bias_to_fp16 = const()[name = tensor<string, []>("ref_enc_convs_1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21632)))];
            tensor<fp16, [1, 32, ?, 129]> input_9_cast_fp16 = conv(bias = ref_enc_convs_1_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = weight_5_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [1, 32, ?, 129]> input_11_cast_fp16 = relu(x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 32, 3, 3]> weight_7_to_fp16 = const()[name = tensor<string, []>("weight_7_to_fp16"), val = tensor<fp16, [64, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21760)))];
            tensor<fp16, [64]> ref_enc_convs_2_bias_to_fp16 = const()[name = tensor<string, []>("ref_enc_convs_2_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58688)))];
            tensor<fp16, [1, 64, ?, 65]> input_13_cast_fp16 = conv(bias = ref_enc_convs_2_bias_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = weight_7_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1, 64, ?, 65]> input_15_cast_fp16 = relu(x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_17_strides_0 = const()[name = tensor<string, []>("input_17_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_17_dilations_0 = const()[name = tensor<string, []>("input_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_17_groups_0 = const()[name = tensor<string, []>("input_17_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> weight_9_to_fp16 = const()[name = tensor<string, []>("weight_9_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58880)))];
            tensor<fp16, [64]> ref_enc_convs_3_bias_to_fp16 = const()[name = tensor<string, []>("ref_enc_convs_3_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132672)))];
            tensor<fp16, [1, 64, ?, 33]> input_17_cast_fp16 = conv(bias = ref_enc_convs_3_bias_to_fp16, dilations = input_17_dilations_0, groups = input_17_groups_0, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = input_17_strides_0, weight = weight_9_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [1, 64, ?, 33]> input_19_cast_fp16 = relu(x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 3, 3]> weight_11_to_fp16 = const()[name = tensor<string, []>("weight_11_to_fp16"), val = tensor<fp16, [128, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132864)))];
            tensor<fp16, [128]> ref_enc_convs_4_bias_to_fp16 = const()[name = tensor<string, []>("ref_enc_convs_4_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(280384)))];
            tensor<fp16, [1, 128, ?, 17]> input_21_cast_fp16 = conv(bias = ref_enc_convs_4_bias_to_fp16, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = weight_11_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1, 128, ?, 17]> input_23_cast_fp16 = relu(x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_25_strides_0 = const()[name = tensor<string, []>("input_25_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_25_dilations_0 = const()[name = tensor<string, []>("input_25_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_25_groups_0 = const()[name = tensor<string, []>("input_25_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 3, 3]> weight_13_to_fp16 = const()[name = tensor<string, []>("weight_13_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(280704)))];
            tensor<fp16, [128]> ref_enc_convs_5_bias_to_fp16 = const()[name = tensor<string, []>("ref_enc_convs_5_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(575680)))];
            tensor<fp16, [1, 128, ?, 9]> input_25_cast_fp16 = conv(bias = ref_enc_convs_5_bias_to_fp16, dilations = input_25_dilations_0, groups = input_25_groups_0, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = input_25_strides_0, weight = weight_13_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1, 128, ?, 9]> out_1_cast_fp16 = relu(x = input_25_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<int32, [4]> out_3_perm_0 = const()[name = tensor<string, []>("out_3_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_0x = const()[name = tensor<string, []>("concat_0x"), val = tensor<int32, [3]>([1, -1, 1152])];
            tensor<fp16, [1, ?, 128, 9]> out_3_cast_fp16 = transpose(perm = out_3_perm_0, x = out_1_cast_fp16)[name = tensor<string, []>("transpose_2")];
            tensor<fp16, [1, ?, 1152]> input_27_cast_fp16 = reshape(shape = concat_0x, x = out_3_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<int32, [3]> transpose_0_perm_0 = const()[name = tensor<string, []>("transpose_0_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp16, [?, 1, 1152]> transpose_0_cast_fp16 = transpose(perm = transpose_0_perm_0, x = input_27_cast_fp16)[name = tensor<string, []>("transpose_1")];
            tensor<int32, [3]> shape_0_cast_fp16 = shape(x = transpose_0_cast_fp16)[name = tensor<string, []>("shape_0_cast_fp16")];
            tensor<int32, [1]> slice_by_index_1_begin_0 = const()[name = tensor<string, []>("slice_by_index_1_begin_0"), val = tensor<int32, [1]>([0])];
            tensor<int32, [1]> slice_by_index_1_end_0 = const()[name = tensor<string, []>("slice_by_index_1_end_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> slice_by_index_1 = slice_by_index(begin = slice_by_index_1_begin_0, end = slice_by_index_1_end_0, x = shape_0_cast_fp16)[name = tensor<string, []>("slice_by_index_1")];
            tensor<int32, [2]> slice_by_index_2 = const()[name = tensor<string, []>("slice_by_index_2"), val = tensor<int32, [2]>([1, 128])];
            tensor<int32, []> concat_1_axis_0 = const()[name = tensor<string, []>("concat_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_1_interleave_0 = const()[name = tensor<string, []>("concat_1_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_1 = concat(axis = concat_1_axis_0, interleave = concat_1_interleave_0, values = (slice_by_index_1, slice_by_index_2))[name = tensor<string, []>("concat_1")];
            tensor<fp16, []> fill_0_value_0_to_fp16 = const()[name = tensor<string, []>("fill_0_value_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [?, 1, 128]> fill_0_cast_fp16 = fill(shape = concat_1, value = fill_0_value_0_to_fp16)[name = tensor<string, []>("fill_0_cast_fp16")];
            tensor<int32, []> concat_2_axis_0 = const()[name = tensor<string, []>("concat_2_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_2_interleave_0 = const()[name = tensor<string, []>("concat_2_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 128]> hx_to_fp16 = const()[name = tensor<string, []>("hx_to_fp16"), val = tensor<fp16, [1, 1, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(576000)))];
            tensor<fp16, [?, 1, 128]> concat_2_cast_fp16 = concat(axis = concat_2_axis_0, interleave = concat_2_interleave_0, values = (hx_to_fp16, fill_0_cast_fp16))[name = tensor<string, []>("concat_2_cast_fp16")];
            tensor<string, []> concat_2_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("concat_2_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<int32, [1]> while_loop_0_loop_vars0_0 = const()[name = tensor<string, []>("while_loop_0_loop_vars0_0"), val = tensor<int32, [1]>([0])];
            tensor<fp32, [?, 1, 128]> concat_2_cast_fp16_to_fp32 = cast(dtype = concat_2_cast_fp16_to_fp32_dtype_0, x = concat_2_cast_fp16)[name = tensor<string, []>("cast_7")];
            tensor<int32, [1]> while_loop_0_0, tensor<fp32, [?, 1, 128]> while_loop_0_1 = while_loop(loop_vars = (while_loop_0_loop_vars0_0, concat_2_cast_fp16_to_fp32))[name = tensor<string, []>("while_loop_0")]
                (tensor<int32, [1]> while_loop_0_loop_vars0_0_x0_1_1_1_0, tensor<fp32, [?, 1, 128]> concat_2_x0_1_1_1_0) {
                    tensor<bool, [1]> less_1 = less(x = while_loop_0_loop_vars0_0_x0_1_1_1_0, y = slice_by_index_1)[name = tensor<string, []>("less_1")];
                } -> (less_1)
                (tensor<int32, [1]> while_loop_0_loop_vars0_0_x0_1_1_1_1, tensor<fp32, [?, 1, 128]> concat_2_x0_1_1_1_1) {
                    tensor<int32, []> gather_6_axis_0 = const()[name = tensor<string, []>("gather_6_axis_0"), val = tensor<int32, []>(0)];
                    tensor<int32, []> gather_6_batch_dims_0 = const()[name = tensor<string, []>("gather_6_batch_dims_0"), val = tensor<int32, []>(0)];
                    tensor<fp16, [1, 1, 1152]> gather_6_cast_fp16 = gather(axis = gather_6_axis_0, batch_dims = gather_6_batch_dims_0, indices = while_loop_0_loop_vars0_0_x0_1_1_1_1, x = transpose_0_cast_fp16)[name = tensor<string, []>("gather_6_cast_fp16")];
                    tensor<int32, []> gather_7_axis_0 = const()[name = tensor<string, []>("gather_7_axis_0"), val = tensor<int32, []>(0)];
                    tensor<int32, []> gather_7_batch_dims_0 = const()[name = tensor<string, []>("gather_7_batch_dims_0"), val = tensor<int32, []>(0)];
                    tensor<string, []> concat_2_x0_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("concat_2_x0_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
                    tensor<fp16, [?, 1, 128]> concat_2_x0_1_to_fp16 = cast(dtype = concat_2_x0_1_to_fp16_dtype_0, x = concat_2_x0_1_1_1_1)[name = tensor<string, []>("cast_6")];
                    tensor<fp16, [1, 1, 128]> gather_7_cast_fp16 = gather(axis = gather_7_axis_0, batch_dims = gather_7_batch_dims_0, indices = while_loop_0_loop_vars0_0_x0_1_1_1_1, x = concat_2_x0_1_to_fp16)[name = tensor<string, []>("gather_7_cast_fp16")];
                    tensor<int32, [1]> squeeze_2_axes_0 = const()[name = tensor<string, []>("squeeze_2_axes_0"), val = tensor<int32, [1]>([0])];
                    tensor<fp16, [1, 1152]> squeeze_2_cast_fp16 = squeeze(axes = squeeze_2_axes_0, x = gather_6_cast_fp16)[name = tensor<string, []>("squeeze_2_cast_fp16")];
                    tensor<int32, [1]> squeeze_3_axes_0 = const()[name = tensor<string, []>("squeeze_3_axes_0"), val = tensor<int32, [1]>([0])];
                    tensor<fp16, [1, 128]> squeeze_3_cast_fp16 = squeeze(axes = squeeze_3_axes_0, x = gather_7_cast_fp16)[name = tensor<string, []>("squeeze_3_cast_fp16")];
                    tensor<fp16, [128, 1152]> linear_6_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_6_weight_0_to_fp16"), val = tensor<fp16, [128, 1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(576320)))];
                    tensor<fp16, [128]> linear_6_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_6_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(871296)))];
                    tensor<fp16, [1, 128]> linear_6_cast_fp16 = linear(bias = linear_6_bias_0_to_fp16, weight = linear_6_weight_0_to_fp16, x = squeeze_2_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
                    tensor<fp16, [128, 128]> linear_7_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_7_weight_0_to_fp16"), val = tensor<fp16, [128, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(871616)))];
                    tensor<fp16, [128]> linear_7_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_7_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(904448)))];
                    tensor<fp16, [1, 128]> linear_7_cast_fp16 = linear(bias = linear_7_bias_0_to_fp16, weight = linear_7_weight_0_to_fp16, x = squeeze_3_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
                    tensor<fp16, [1, 128]> add_5_cast_fp16 = add(x = linear_6_cast_fp16, y = linear_7_cast_fp16)[name = tensor<string, []>("add_5_cast_fp16")];
                    tensor<fp16, [1, 128]> sigmoid_2_cast_fp16 = sigmoid(x = add_5_cast_fp16)[name = tensor<string, []>("sigmoid_2_cast_fp16")];
                    tensor<fp16, [128, 1152]> linear_8_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_8_weight_0_to_fp16"), val = tensor<fp16, [128, 1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(904768)))];
                    tensor<fp16, [128]> linear_8_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_8_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1199744)))];
                    tensor<fp16, [1, 128]> linear_8_cast_fp16 = linear(bias = linear_8_bias_0_to_fp16, weight = linear_8_weight_0_to_fp16, x = squeeze_2_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
                    tensor<fp16, [128, 128]> linear_9_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_9_weight_0_to_fp16"), val = tensor<fp16, [128, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1200064)))];
                    tensor<fp16, [128]> linear_9_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_9_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1232896)))];
                    tensor<fp16, [1, 128]> linear_9_cast_fp16 = linear(bias = linear_9_bias_0_to_fp16, weight = linear_9_weight_0_to_fp16, x = squeeze_3_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
                    tensor<fp16, [1, 128]> add_6_cast_fp16 = add(x = linear_8_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("add_6_cast_fp16")];
                    tensor<fp16, [1, 128]> sigmoid_3_cast_fp16 = sigmoid(x = add_6_cast_fp16)[name = tensor<string, []>("sigmoid_3_cast_fp16")];
                    tensor<fp16, [128, 1152]> linear_10_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_10_weight_0_to_fp16"), val = tensor<fp16, [128, 1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1233216)))];
                    tensor<fp16, [128]> linear_10_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_10_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1528192)))];
                    tensor<fp16, [1, 128]> linear_10_cast_fp16 = linear(bias = linear_10_bias_0_to_fp16, weight = linear_10_weight_0_to_fp16, x = squeeze_2_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
                    tensor<fp16, [128, 128]> linear_11_weight_0_to_fp16 = const()[name = tensor<string, []>("linear_11_weight_0_to_fp16"), val = tensor<fp16, [128, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1528512)))];
                    tensor<fp16, [128]> linear_11_bias_0_to_fp16 = const()[name = tensor<string, []>("linear_11_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1561344)))];
                    tensor<fp16, [1, 128]> linear_11_cast_fp16 = linear(bias = linear_11_bias_0_to_fp16, weight = linear_11_weight_0_to_fp16, x = squeeze_3_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
                    tensor<fp16, [1, 128]> mul_3_cast_fp16 = mul(x = sigmoid_2_cast_fp16, y = linear_11_cast_fp16)[name = tensor<string, []>("mul_3_cast_fp16")];
                    tensor<fp16, [1, 128]> add_7_cast_fp16 = add(x = linear_10_cast_fp16, y = mul_3_cast_fp16)[name = tensor<string, []>("add_7_cast_fp16")];
                    tensor<fp16, [1, 128]> tanh_1_cast_fp16 = tanh(x = add_7_cast_fp16)[name = tensor<string, []>("tanh_1_cast_fp16")];
                    tensor<fp16, []> sub_1_x_0_to_fp16 = const()[name = tensor<string, []>("sub_1_x_0_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
                    tensor<fp16, [1, 128]> sub_1_cast_fp16 = sub(x = sub_1_x_0_to_fp16, y = sigmoid_3_cast_fp16)[name = tensor<string, []>("sub_1_cast_fp16")];
                    tensor<fp16, [1, 128]> mul_4_cast_fp16 = mul(x = sub_1_cast_fp16, y = tanh_1_cast_fp16)[name = tensor<string, []>("mul_4_cast_fp16")];
                    tensor<fp16, [1, 128]> mul_5_cast_fp16 = mul(x = sigmoid_3_cast_fp16, y = squeeze_3_cast_fp16)[name = tensor<string, []>("mul_5_cast_fp16")];
                    tensor<fp16, [1, 128]> add_8_cast_fp16 = add(x = mul_4_cast_fp16, y = mul_5_cast_fp16)[name = tensor<string, []>("add_8_cast_fp16")];
                    tensor<int32, []> add_9_y_0 = const()[name = tensor<string, []>("add_9_y_0"), val = tensor<int32, []>(1)];
                    tensor<int32, [1]> add_9 = add(x = while_loop_0_loop_vars0_0_x0_1_1_1_1, y = add_9_y_0)[name = tensor<string, []>("add_9")];
                    tensor<int32, [1]> expand_dims_1_axes_0 = const()[name = tensor<string, []>("expand_dims_1_axes_0"), val = tensor<int32, [1]>([0])];
                    tensor<fp16, [1, 1, 128]> expand_dims_1_cast_fp16 = expand_dims(axes = expand_dims_1_axes_0, x = add_8_cast_fp16)[name = tensor<string, []>("expand_dims_1_cast_fp16")];
                    tensor<int32, []> scatter_1_axis_0 = const()[name = tensor<string, []>("scatter_1_axis_0"), val = tensor<int32, []>(0)];
                    tensor<string, []> scatter_1_mode_0 = const()[name = tensor<string, []>("scatter_1_mode_0"), val = tensor<string, []>("add")];
                    tensor<fp16, [?, 1, 128]> scatter_1_cast_fp16 = scatter(axis = scatter_1_axis_0, data = concat_2_x0_1_to_fp16, indices = add_9, mode = scatter_1_mode_0, updates = expand_dims_1_cast_fp16)[name = tensor<string, []>("scatter_1_cast_fp16")];
                    tensor<string, []> scatter_1_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("scatter_1_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
                    tensor<fp32, [?, 1, 128]> scatter_1_cast_fp16_to_fp32 = cast(dtype = scatter_1_cast_fp16_to_fp32_dtype_0, x = scatter_1_cast_fp16)[name = tensor<string, []>("cast_5")];
                } -> (add_9, scatter_1_cast_fp16_to_fp32);
            tensor<int32, [3]> var_136_tmp_begin_0 = const()[name = tensor<string, []>("op_136_tmp_begin_0"), val = tensor<int32, [3]>([1, 0, 0])];
            tensor<int32, [3]> var_136_tmp_end_0 = const()[name = tensor<string, []>("op_136_tmp_end_0"), val = tensor<int32, [3]>([0, 0, 0])];
            tensor<bool, [3]> var_136_tmp_begin_mask_0 = const()[name = tensor<string, []>("op_136_tmp_begin_mask_0"), val = tensor<bool, [3]>([false, true, true])];
            tensor<bool, [3]> var_136_tmp_end_mask_0 = const()[name = tensor<string, []>("op_136_tmp_end_mask_0"), val = tensor<bool, [3]>([true, true, true])];
            tensor<string, []> while_loop_0_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("while_loop_0_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [?, 1, 128]> while_loop_0_1_to_fp16 = cast(dtype = while_loop_0_1_to_fp16_dtype_0, x = while_loop_0_1)[name = tensor<string, []>("cast_4")];
            tensor<fp16, [?, 1, 128]> var_136_tmp_cast_fp16 = slice_by_index(begin = var_136_tmp_begin_0, begin_mask = var_136_tmp_begin_mask_0, end = var_136_tmp_end_0, end_mask = var_136_tmp_end_mask_0, x = while_loop_0_1_to_fp16)[name = tensor<string, []>("op_136_tmp_cast_fp16")];
            tensor<int32, [3]> out_layer_0_begin_0 = const()[name = tensor<string, []>("out_layer_0_begin_0"), val = tensor<int32, [3]>([-1, 0, 0])];
            tensor<int32, [3]> out_layer_0_end_0 = const()[name = tensor<string, []>("out_layer_0_end_0"), val = tensor<int32, [3]>([-2, 0, 0])];
            tensor<bool, [3]> out_layer_0_begin_mask_0 = const()[name = tensor<string, []>("out_layer_0_begin_mask_0"), val = tensor<bool, [3]>([false, true, true])];
            tensor<bool, [3]> out_layer_0_end_mask_0 = const()[name = tensor<string, []>("out_layer_0_end_mask_0"), val = tensor<bool, [3]>([false, true, true])];
            tensor<int32, [3]> out_layer_0_stride_0 = const()[name = tensor<string, []>("out_layer_0_stride_0"), val = tensor<int32, [3]>([-1, 1, 1])];
            tensor<fp16, [1, 1, 128]> out_layer_0_cast_fp16 = slice_by_index(begin = out_layer_0_begin_0, begin_mask = out_layer_0_begin_mask_0, end = out_layer_0_end_0, end_mask = out_layer_0_end_mask_0, stride = out_layer_0_stride_0, x = var_136_tmp_cast_fp16)[name = tensor<string, []>("out_layer_0_cast_fp16")];
            tensor<int32, [1]> input_axes_0 = const()[name = tensor<string, []>("input_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 128]> input_cast_fp16 = squeeze(axes = input_axes_0, x = out_layer_0_cast_fp16)[name = tensor<string, []>("input_cast_fp16")];
            tensor<fp16, [256, 128]> ref_enc_proj_weight_to_fp16 = const()[name = tensor<string, []>("ref_enc_proj_weight_to_fp16"), val = tensor<fp16, [256, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1561664)))];
            tensor<fp16, [256]> ref_enc_proj_bias_to_fp16 = const()[name = tensor<string, []>("ref_enc_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1627264)))];
            tensor<fp16, [1, 256]> linear_12_cast_fp16 = linear(bias = ref_enc_proj_bias_to_fp16, weight = ref_enc_proj_weight_to_fp16, x = input_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [1]> var_143_axes_0 = const()[name = tensor<string, []>("op_143_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 256, 1]> speaker_embedding = expand_dims(axes = var_143_axes_0, x = linear_12_cast_fp16)[name = tensor<string, []>("op_143_cast_fp16")];
        } -> (speaker_embedding);
}