program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp32, [1, 3, 112, 112]> face_image) {
            tensor<fp32, []> face_image__scaled___y_0 = const()[name = tensor<string, []>("face_image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-7)];
            tensor<fp32, [1, 3, 112, 112]> face_image__scaled__ = mul(x = face_image, y = face_image__scaled___y_0)[name = tensor<string, []>("face_image__scaled__")];
            tensor<fp32, [1, 3, 1, 1]> face_image__biased___y_0 = const()[name = tensor<string, []>("face_image__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1p+0]], [[-0x1p+0]], [[-0x1p+0]]]])];
            tensor<fp32, [1, 3, 112, 112]> face_image__biased__ = add(x = face_image__scaled__, y = face_image__biased___y_0)[name = tensor<string, []>("face_image__biased__")];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> face_image_to_fp16_dtype_0 = const()[name = tensor<string, []>("face_image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [64, 3, 3, 3]> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, [64, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [64]> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3584)))];
            tensor<fp16, [1, 3, 112, 112]> face_image_to_fp16 = cast(dtype = face_image_to_fp16_dtype_0, x = face_image__biased__)[name = tensor<string, []>("cast_4")];
            tensor<fp16, [1, 64, 112, 112]> input_3_cast_fp16 = conv(bias = const_2_to_fp16, dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = const_1_to_fp16, x = face_image_to_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<fp16, [64]> input_5_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_5_alpha_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3776)))];
            tensor<fp16, [1, 64, 112, 112]> input_5_cast_fp16 = prelu(alpha = input_5_alpha_0_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [2]> var_41 = const()[name = tensor<string, []>("op_41"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_42 = const()[name = tensor<string, []>("op_42"), val = tensor<int32, [2]>([2, 2])];
            tensor<string, []> shortcut_1_pad_type_0 = const()[name = tensor<string, []>("shortcut_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> shortcut_1_pad_0 = const()[name = tensor<string, []>("shortcut_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> shortcut_1_ceil_mode_0 = const()[name = tensor<string, []>("shortcut_1_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 64, 56, 56]> shortcut_1_cast_fp16 = max_pool(ceil_mode = shortcut_1_ceil_mode_0, kernel_sizes = var_41, pad = shortcut_1_pad_0, pad_type = shortcut_1_pad_type_0, strides = var_42, x = input_5_cast_fp16)[name = tensor<string, []>("shortcut_1_cast_fp16")];
            tensor<fp16, [64]> backbone_body_0_res_layer_0_running_mean_to_fp16 = const()[name = tensor<string, []>("backbone_body_0_res_layer_0_running_mean_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3968)))];
            tensor<fp16, [64]> backbone_body_0_res_layer_0_running_var_to_fp16 = const()[name = tensor<string, []>("backbone_body_0_res_layer_0_running_var_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4160)))];
            tensor<fp16, [64]> backbone_body_0_res_layer_0_weight_to_fp16 = const()[name = tensor<string, []>("backbone_body_0_res_layer_0_weight_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4352)))];
            tensor<fp16, [64]> backbone_body_0_res_layer_0_bias_to_fp16 = const()[name = tensor<string, []>("backbone_body_0_res_layer_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4544)))];
            tensor<fp16, []> var_11_to_fp16 = const()[name = tensor<string, []>("op_11_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 64, 112, 112]> input_7_cast_fp16 = batch_norm(beta = backbone_body_0_res_layer_0_bias_to_fp16, epsilon = var_11_to_fp16, gamma = backbone_body_0_res_layer_0_weight_to_fp16, mean = backbone_body_0_res_layer_0_running_mean_to_fp16, variance = backbone_body_0_res_layer_0_running_var_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4736)))];
            tensor<fp16, [64]> const_4_to_fp16 = const()[name = tensor<string, []>("const_4_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(78528)))];
            tensor<fp16, [1, 64, 112, 112]> input_11_cast_fp16 = conv(bias = const_4_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = const_3_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [64]> input_13_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_13_alpha_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(78720)))];
            tensor<fp16, [1, 64, 112, 112]> input_13_cast_fp16 = prelu(alpha = input_13_alpha_0_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> input_15_pad_type_0 = const()[name = tensor<string, []>("input_15_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_15_pad_0 = const()[name = tensor<string, []>("input_15_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_15_strides_0 = const()[name = tensor<string, []>("input_15_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_15_dilations_0 = const()[name = tensor<string, []>("input_15_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_15_groups_0 = const()[name = tensor<string, []>("input_15_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> const_5_to_fp16 = const()[name = tensor<string, []>("const_5_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(78912)))];
            tensor<fp16, [64]> const_6_to_fp16 = const()[name = tensor<string, []>("const_6_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(152704)))];
            tensor<fp16, [1, 64, 56, 56]> res_1_cast_fp16 = conv(bias = const_6_to_fp16, dilations = input_15_dilations_0, groups = input_15_groups_0, pad = input_15_pad_0, pad_type = input_15_pad_type_0, strides = input_15_strides_0, weight = const_5_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("res_1_cast_fp16")];
            tensor<fp16, [1, 64, 56, 56]> input_17_cast_fp16 = add(x = res_1_cast_fp16, y = shortcut_1_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<int32, [2]> var_83 = const()[name = tensor<string, []>("op_83"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_84 = const()[name = tensor<string, []>("op_84"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> shortcut_3_pad_type_0 = const()[name = tensor<string, []>("shortcut_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> shortcut_3_pad_0 = const()[name = tensor<string, []>("shortcut_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> shortcut_3_ceil_mode_0 = const()[name = tensor<string, []>("shortcut_3_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 64, 56, 56]> shortcut_3_cast_fp16 = max_pool(ceil_mode = shortcut_3_ceil_mode_0, kernel_sizes = var_83, pad = shortcut_3_pad_0, pad_type = shortcut_3_pad_type_0, strides = var_84, x = input_17_cast_fp16)[name = tensor<string, []>("shortcut_3_cast_fp16")];
            tensor<fp16, [64]> backbone_body_1_res_layer_0_running_mean_to_fp16 = const()[name = tensor<string, []>("backbone_body_1_res_layer_0_running_mean_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(152896)))];
            tensor<fp16, [64]> backbone_body_1_res_layer_0_running_var_to_fp16 = const()[name = tensor<string, []>("backbone_body_1_res_layer_0_running_var_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(153088)))];
            tensor<fp16, [64]> backbone_body_1_res_layer_0_weight_to_fp16 = const()[name = tensor<string, []>("backbone_body_1_res_layer_0_weight_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(153280)))];
            tensor<fp16, [64]> backbone_body_1_res_layer_0_bias_to_fp16 = const()[name = tensor<string, []>("backbone_body_1_res_layer_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(153472)))];
            tensor<fp16, [1, 64, 56, 56]> input_19_cast_fp16 = batch_norm(beta = backbone_body_1_res_layer_0_bias_to_fp16, epsilon = var_11_to_fp16, gamma = backbone_body_1_res_layer_0_weight_to_fp16, mean = backbone_body_1_res_layer_0_running_mean_to_fp16, variance = backbone_body_1_res_layer_0_running_var_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> const_7_to_fp16 = const()[name = tensor<string, []>("const_7_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(153664)))];
            tensor<fp16, [64]> const_8_to_fp16 = const()[name = tensor<string, []>("const_8_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(227456)))];
            tensor<fp16, [1, 64, 56, 56]> input_23_cast_fp16 = conv(bias = const_8_to_fp16, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = const_7_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [64]> input_25_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_25_alpha_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(227648)))];
            tensor<fp16, [1, 64, 56, 56]> input_25_cast_fp16 = prelu(alpha = input_25_alpha_0_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<string, []> input_27_pad_type_0 = const()[name = tensor<string, []>("input_27_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_27_pad_0 = const()[name = tensor<string, []>("input_27_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_27_strides_0 = const()[name = tensor<string, []>("input_27_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_27_dilations_0 = const()[name = tensor<string, []>("input_27_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_27_groups_0 = const()[name = tensor<string, []>("input_27_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> const_9_to_fp16 = const()[name = tensor<string, []>("const_9_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(227840)))];
            tensor<fp16, [64]> const_10_to_fp16 = const()[name = tensor<string, []>("const_10_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(301632)))];
            tensor<fp16, [1, 64, 56, 56]> res_3_cast_fp16 = conv(bias = const_10_to_fp16, dilations = input_27_dilations_0, groups = input_27_groups_0, pad = input_27_pad_0, pad_type = input_27_pad_type_0, strides = input_27_strides_0, weight = const_9_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("res_3_cast_fp16")];
            tensor<fp16, [1, 64, 56, 56]> input_29_cast_fp16 = add(x = res_3_cast_fp16, y = shortcut_3_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<string, []> input_31_pad_type_0 = const()[name = tensor<string, []>("input_31_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_31_strides_0 = const()[name = tensor<string, []>("input_31_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_31_pad_0 = const()[name = tensor<string, []>("input_31_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_31_dilations_0 = const()[name = tensor<string, []>("input_31_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_31_groups_0 = const()[name = tensor<string, []>("input_31_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 1, 1]> const_11_to_fp16 = const()[name = tensor<string, []>("const_11_to_fp16"), val = tensor<fp16, [128, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(301824)))];
            tensor<fp16, [128]> const_12_to_fp16 = const()[name = tensor<string, []>("const_12_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(318272)))];
            tensor<fp16, [1, 128, 28, 28]> shortcut_5_cast_fp16 = conv(bias = const_12_to_fp16, dilations = input_31_dilations_0, groups = input_31_groups_0, pad = input_31_pad_0, pad_type = input_31_pad_type_0, strides = input_31_strides_0, weight = const_11_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("shortcut_5_cast_fp16")];
            tensor<fp16, [64]> backbone_body_2_res_layer_0_running_mean_to_fp16 = const()[name = tensor<string, []>("backbone_body_2_res_layer_0_running_mean_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(318592)))];
            tensor<fp16, [64]> backbone_body_2_res_layer_0_running_var_to_fp16 = const()[name = tensor<string, []>("backbone_body_2_res_layer_0_running_var_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(318784)))];
            tensor<fp16, [64]> backbone_body_2_res_layer_0_weight_to_fp16 = const()[name = tensor<string, []>("backbone_body_2_res_layer_0_weight_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(318976)))];
            tensor<fp16, [64]> backbone_body_2_res_layer_0_bias_to_fp16 = const()[name = tensor<string, []>("backbone_body_2_res_layer_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(319168)))];
            tensor<fp16, [1, 64, 56, 56]> input_33_cast_fp16 = batch_norm(beta = backbone_body_2_res_layer_0_bias_to_fp16, epsilon = var_11_to_fp16, gamma = backbone_body_2_res_layer_0_weight_to_fp16, mean = backbone_body_2_res_layer_0_running_mean_to_fp16, variance = backbone_body_2_res_layer_0_running_var_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<string, []> input_35_pad_type_0 = const()[name = tensor<string, []>("input_35_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_35_pad_0 = const()[name = tensor<string, []>("input_35_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_35_strides_0 = const()[name = tensor<string, []>("input_35_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_35_dilations_0 = const()[name = tensor<string, []>("input_35_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_35_groups_0 = const()[name = tensor<string, []>("input_35_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 3, 3]> const_13_to_fp16 = const()[name = tensor<string, []>("const_13_to_fp16"), val = tensor<fp16, [128, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(319360)))];
            tensor<fp16, [128]> const_14_to_fp16 = const()[name = tensor<string, []>("const_14_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(466880)))];
            tensor<fp16, [1, 128, 56, 56]> input_37_cast_fp16 = conv(bias = const_14_to_fp16, dilations = input_35_dilations_0, groups = input_35_groups_0, pad = input_35_pad_0, pad_type = input_35_pad_type_0, strides = input_35_strides_0, weight = const_13_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [128]> input_39_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_39_alpha_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(467200)))];
            tensor<fp16, [1, 128, 56, 56]> input_39_cast_fp16 = prelu(alpha = input_39_alpha_0_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_41_strides_0 = const()[name = tensor<string, []>("input_41_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_41_dilations_0 = const()[name = tensor<string, []>("input_41_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_41_groups_0 = const()[name = tensor<string, []>("input_41_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 3, 3]> const_15_to_fp16 = const()[name = tensor<string, []>("const_15_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(467520)))];
            tensor<fp16, [128]> const_16_to_fp16 = const()[name = tensor<string, []>("const_16_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(762496)))];
            tensor<fp16, [1, 128, 28, 28]> res_5_cast_fp16 = conv(bias = const_16_to_fp16, dilations = input_41_dilations_0, groups = input_41_groups_0, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = input_41_strides_0, weight = const_15_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("res_5_cast_fp16")];
            tensor<fp16, [1, 128, 28, 28]> input_43_cast_fp16 = add(x = res_5_cast_fp16, y = shortcut_5_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<int32, [2]> var_176 = const()[name = tensor<string, []>("op_176"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_177 = const()[name = tensor<string, []>("op_177"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> shortcut_7_pad_type_0 = const()[name = tensor<string, []>("shortcut_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> shortcut_7_pad_0 = const()[name = tensor<string, []>("shortcut_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> shortcut_7_ceil_mode_0 = const()[name = tensor<string, []>("shortcut_7_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 28, 28]> shortcut_7_cast_fp16 = max_pool(ceil_mode = shortcut_7_ceil_mode_0, kernel_sizes = var_176, pad = shortcut_7_pad_0, pad_type = shortcut_7_pad_type_0, strides = var_177, x = input_43_cast_fp16)[name = tensor<string, []>("shortcut_7_cast_fp16")];
            tensor<fp16, [128]> backbone_body_3_res_layer_0_running_mean_to_fp16 = const()[name = tensor<string, []>("backbone_body_3_res_layer_0_running_mean_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(762816)))];
            tensor<fp16, [128]> backbone_body_3_res_layer_0_running_var_to_fp16 = const()[name = tensor<string, []>("backbone_body_3_res_layer_0_running_var_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(763136)))];
            tensor<fp16, [128]> backbone_body_3_res_layer_0_weight_to_fp16 = const()[name = tensor<string, []>("backbone_body_3_res_layer_0_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(763456)))];
            tensor<fp16, [128]> backbone_body_3_res_layer_0_bias_to_fp16 = const()[name = tensor<string, []>("backbone_body_3_res_layer_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(763776)))];
            tensor<fp16, [1, 128, 28, 28]> input_45_cast_fp16 = batch_norm(beta = backbone_body_3_res_layer_0_bias_to_fp16, epsilon = var_11_to_fp16, gamma = backbone_body_3_res_layer_0_weight_to_fp16, mean = backbone_body_3_res_layer_0_running_mean_to_fp16, variance = backbone_body_3_res_layer_0_running_var_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<string, []> input_47_pad_type_0 = const()[name = tensor<string, []>("input_47_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_47_pad_0 = const()[name = tensor<string, []>("input_47_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_47_strides_0 = const()[name = tensor<string, []>("input_47_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_47_dilations_0 = const()[name = tensor<string, []>("input_47_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_47_groups_0 = const()[name = tensor<string, []>("input_47_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 3, 3]> const_17_to_fp16 = const()[name = tensor<string, []>("const_17_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(764096)))];
            tensor<fp16, [128]> const_18_to_fp16 = const()[name = tensor<string, []>("const_18_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1059072)))];
            tensor<fp16, [1, 128, 28, 28]> input_49_cast_fp16 = conv(bias = const_18_to_fp16, dilations = input_47_dilations_0, groups = input_47_groups_0, pad = input_47_pad_0, pad_type = input_47_pad_type_0, strides = input_47_strides_0, weight = const_17_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, [128]> input_51_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_51_alpha_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1059392)))];
            tensor<fp16, [1, 128, 28, 28]> input_51_cast_fp16 = prelu(alpha = input_51_alpha_0_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<string, []> input_53_pad_type_0 = const()[name = tensor<string, []>("input_53_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_53_pad_0 = const()[name = tensor<string, []>("input_53_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_53_strides_0 = const()[name = tensor<string, []>("input_53_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_53_dilations_0 = const()[name = tensor<string, []>("input_53_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_53_groups_0 = const()[name = tensor<string, []>("input_53_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 3, 3]> const_19_to_fp16 = const()[name = tensor<string, []>("const_19_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1059712)))];
            tensor<fp16, [128]> const_20_to_fp16 = const()[name = tensor<string, []>("const_20_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1354688)))];
            tensor<fp16, [1, 128, 28, 28]> res_7_cast_fp16 = conv(bias = const_20_to_fp16, dilations = input_53_dilations_0, groups = input_53_groups_0, pad = input_53_pad_0, pad_type = input_53_pad_type_0, strides = input_53_strides_0, weight = const_19_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("res_7_cast_fp16")];
            tensor<fp16, [1, 128, 28, 28]> input_55_cast_fp16 = add(x = res_7_cast_fp16, y = shortcut_7_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<string, []> input_57_pad_type_0 = const()[name = tensor<string, []>("input_57_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_57_strides_0 = const()[name = tensor<string, []>("input_57_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_57_pad_0 = const()[name = tensor<string, []>("input_57_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_57_dilations_0 = const()[name = tensor<string, []>("input_57_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_57_groups_0 = const()[name = tensor<string, []>("input_57_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 128, 1, 1]> const_21_to_fp16 = const()[name = tensor<string, []>("const_21_to_fp16"), val = tensor<fp16, [256, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1355008)))];
            tensor<fp16, [256]> const_22_to_fp16 = const()[name = tensor<string, []>("const_22_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1420608)))];
            tensor<fp16, [1, 256, 14, 14]> shortcut_9_cast_fp16 = conv(bias = const_22_to_fp16, dilations = input_57_dilations_0, groups = input_57_groups_0, pad = input_57_pad_0, pad_type = input_57_pad_type_0, strides = input_57_strides_0, weight = const_21_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("shortcut_9_cast_fp16")];
            tensor<fp16, [128]> backbone_body_4_res_layer_0_running_mean_to_fp16 = const()[name = tensor<string, []>("backbone_body_4_res_layer_0_running_mean_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1421184)))];
            tensor<fp16, [128]> backbone_body_4_res_layer_0_running_var_to_fp16 = const()[name = tensor<string, []>("backbone_body_4_res_layer_0_running_var_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1421504)))];
            tensor<fp16, [128]> backbone_body_4_res_layer_0_weight_to_fp16 = const()[name = tensor<string, []>("backbone_body_4_res_layer_0_weight_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1421824)))];
            tensor<fp16, [128]> backbone_body_4_res_layer_0_bias_to_fp16 = const()[name = tensor<string, []>("backbone_body_4_res_layer_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1422144)))];
            tensor<fp16, [1, 128, 28, 28]> input_59_cast_fp16 = batch_norm(beta = backbone_body_4_res_layer_0_bias_to_fp16, epsilon = var_11_to_fp16, gamma = backbone_body_4_res_layer_0_weight_to_fp16, mean = backbone_body_4_res_layer_0_running_mean_to_fp16, variance = backbone_body_4_res_layer_0_running_var_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<string, []> input_61_pad_type_0 = const()[name = tensor<string, []>("input_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_61_pad_0 = const()[name = tensor<string, []>("input_61_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_61_strides_0 = const()[name = tensor<string, []>("input_61_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_61_dilations_0 = const()[name = tensor<string, []>("input_61_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_61_groups_0 = const()[name = tensor<string, []>("input_61_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 128, 3, 3]> const_23_to_fp16 = const()[name = tensor<string, []>("const_23_to_fp16"), val = tensor<fp16, [256, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1422464)))];
            tensor<fp16, [256]> const_24_to_fp16 = const()[name = tensor<string, []>("const_24_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2012352)))];
            tensor<fp16, [1, 256, 28, 28]> input_63_cast_fp16 = conv(bias = const_24_to_fp16, dilations = input_61_dilations_0, groups = input_61_groups_0, pad = input_61_pad_0, pad_type = input_61_pad_type_0, strides = input_61_strides_0, weight = const_23_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<fp16, [256]> input_65_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_65_alpha_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2012928)))];
            tensor<fp16, [1, 256, 28, 28]> input_65_cast_fp16 = prelu(alpha = input_65_alpha_0_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<string, []> input_67_pad_type_0 = const()[name = tensor<string, []>("input_67_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_67_pad_0 = const()[name = tensor<string, []>("input_67_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_67_strides_0 = const()[name = tensor<string, []>("input_67_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_67_dilations_0 = const()[name = tensor<string, []>("input_67_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_67_groups_0 = const()[name = tensor<string, []>("input_67_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 3, 3]> const_25_to_fp16 = const()[name = tensor<string, []>("const_25_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2013504)))];
            tensor<fp16, [256]> const_26_to_fp16 = const()[name = tensor<string, []>("const_26_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3193216)))];
            tensor<fp16, [1, 256, 14, 14]> res_9_cast_fp16 = conv(bias = const_26_to_fp16, dilations = input_67_dilations_0, groups = input_67_groups_0, pad = input_67_pad_0, pad_type = input_67_pad_type_0, strides = input_67_strides_0, weight = const_25_to_fp16, x = input_65_cast_fp16)[name = tensor<string, []>("res_9_cast_fp16")];
            tensor<fp16, [1, 256, 14, 14]> input_69_cast_fp16 = add(x = res_9_cast_fp16, y = shortcut_9_cast_fp16)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<int32, [2]> var_269 = const()[name = tensor<string, []>("op_269"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_270 = const()[name = tensor<string, []>("op_270"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> shortcut_11_pad_type_0 = const()[name = tensor<string, []>("shortcut_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> shortcut_11_pad_0 = const()[name = tensor<string, []>("shortcut_11_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> shortcut_11_ceil_mode_0 = const()[name = tensor<string, []>("shortcut_11_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 14, 14]> shortcut_11_cast_fp16 = max_pool(ceil_mode = shortcut_11_ceil_mode_0, kernel_sizes = var_269, pad = shortcut_11_pad_0, pad_type = shortcut_11_pad_type_0, strides = var_270, x = input_69_cast_fp16)[name = tensor<string, []>("shortcut_11_cast_fp16")];
            tensor<fp16, [256]> backbone_body_5_res_layer_0_running_mean_to_fp16 = const()[name = tensor<string, []>("backbone_body_5_res_layer_0_running_mean_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3193792)))];
            tensor<fp16, [256]> backbone_body_5_res_layer_0_running_var_to_fp16 = const()[name = tensor<string, []>("backbone_body_5_res_layer_0_running_var_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3194368)))];
            tensor<fp16, [256]> backbone_body_5_res_layer_0_weight_to_fp16 = const()[name = tensor<string, []>("backbone_body_5_res_layer_0_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3194944)))];
            tensor<fp16, [256]> backbone_body_5_res_layer_0_bias_to_fp16 = const()[name = tensor<string, []>("backbone_body_5_res_layer_0_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3195520)))];
            tensor<fp16, [1, 256, 14, 14]> input_71_cast_fp16 = batch_norm(beta = backbone_body_5_res_layer_0_bias_to_fp16, epsilon = var_11_to_fp16, gamma = backbone_body_5_res_layer_0_weight_to_fp16, mean = backbone_body_5_res_layer_0_running_mean_to_fp16, variance = backbone_body_5_res_layer_0_running_var_to_fp16, x = input_69_cast_fp16)[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<string, []> input_73_pad_type_0 = const()[name = tensor<string, []>("input_73_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_73_pad_0 = const()[name = tensor<string, []>("input_73_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_73_strides_0 = const()[name = tensor<string, []>("input_73_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_73_dilations_0 = const()[name = tensor<string, []>("input_73_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_73_groups_0 = const()[name = tensor<string, []>("input_73_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 3, 3]> const_27_to_fp16 = const()[name = tensor<string, []>("const_27_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3196096)))];
            tensor<fp16, [256]> const_28_to_fp16 = const()[name = tensor<string, []>("const_28_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4375808)))];
            tensor<fp16, [1, 256, 14, 14]> input_75_cast_fp16 = conv(bias = const_28_to_fp16, dilations = input_73_dilations_0, groups = input_73_groups_0, pad = input_73_pad_0, pad_type = input_73_pad_type_0, strides = input_73_strides_0, weight = const_27_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<fp16, [256]> input_77_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_77_alpha_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4376384)))];
            tensor<fp16, [1, 256, 14, 14]> input_77_cast_fp16 = prelu(alpha = input_77_alpha_0_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<string, []> input_79_pad_type_0 = const()[name = tensor<string, []>("input_79_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_79_pad_0 = const()[name = tensor<string, []>("input_79_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_79_strides_0 = const()[name = tensor<string, []>("input_79_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_79_dilations_0 = const()[name = tensor<string, []>("input_79_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_79_groups_0 = const()[name = tensor<string, []>("input_79_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 3, 3]> const_29_to_fp16 = const()[name = tensor<string, []>("const_29_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4376960)))];
            tensor<fp16, [256]> const_30_to_fp16 = const()[name = tensor<string, []>("const_30_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5556672)))];
            tensor<fp16, [1, 256, 14, 14]> res_11_cast_fp16 = conv(bias = const_30_to_fp16, dilations = input_79_dilations_0, groups = input_79_groups_0, pad = input_79_pad_0, pad_type = input_79_pad_type_0, strides = input_79_strides_0, weight = const_29_to_fp16, x = input_77_cast_fp16)[name = tensor<string, []>("res_11_cast_fp16")];
            tensor<fp16, [1, 256, 14, 14]> input_81_cast_fp16 = add(x = res_11_cast_fp16, y = shortcut_11_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<string, []> input_83_pad_type_0 = const()[name = tensor<string, []>("input_83_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_83_strides_0 = const()[name = tensor<string, []>("input_83_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [4]> input_83_pad_0 = const()[name = tensor<string, []>("input_83_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_83_dilations_0 = const()[name = tensor<string, []>("input_83_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_83_groups_0 = const()[name = tensor<string, []>("input_83_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 256, 1, 1]> const_31_to_fp16 = const()[name = tensor<string, []>("const_31_to_fp16"), val = tensor<fp16, [512, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5557248)))];
            tensor<fp16, [512]> const_32_to_fp16 = const()[name = tensor<string, []>("const_32_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5819456)))];
            tensor<fp16, [1, 512, 7, 7]> shortcut_13_cast_fp16 = conv(bias = const_32_to_fp16, dilations = input_83_dilations_0, groups = input_83_groups_0, pad = input_83_pad_0, pad_type = input_83_pad_type_0, strides = input_83_strides_0, weight = const_31_to_fp16, x = input_81_cast_fp16)[name = tensor<string, []>("shortcut_13_cast_fp16")];
            tensor<fp16, [256]> backbone_body_6_res_layer_0_running_mean_to_fp16 = const()[name = tensor<string, []>("backbone_body_6_res_layer_0_running_mean_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5820544)))];
            tensor<fp16, [256]> backbone_body_6_res_layer_0_running_var_to_fp16 = const()[name = tensor<string, []>("backbone_body_6_res_layer_0_running_var_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5821120)))];
            tensor<fp16, [256]> backbone_body_6_res_layer_0_weight_to_fp16 = const()[name = tensor<string, []>("backbone_body_6_res_layer_0_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5821696)))];
            tensor<fp16, [256]> backbone_body_6_res_layer_0_bias_to_fp16 = const()[name = tensor<string, []>("backbone_body_6_res_layer_0_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5822272)))];
            tensor<fp16, [1, 256, 14, 14]> input_85_cast_fp16 = batch_norm(beta = backbone_body_6_res_layer_0_bias_to_fp16, epsilon = var_11_to_fp16, gamma = backbone_body_6_res_layer_0_weight_to_fp16, mean = backbone_body_6_res_layer_0_running_mean_to_fp16, variance = backbone_body_6_res_layer_0_running_var_to_fp16, x = input_81_cast_fp16)[name = tensor<string, []>("input_85_cast_fp16")];
            tensor<string, []> input_87_pad_type_0 = const()[name = tensor<string, []>("input_87_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_87_pad_0 = const()[name = tensor<string, []>("input_87_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_87_strides_0 = const()[name = tensor<string, []>("input_87_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_87_dilations_0 = const()[name = tensor<string, []>("input_87_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_87_groups_0 = const()[name = tensor<string, []>("input_87_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 256, 3, 3]> const_33_to_fp16 = const()[name = tensor<string, []>("const_33_to_fp16"), val = tensor<fp16, [512, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5822848)))];
            tensor<fp16, [512]> const_34_to_fp16 = const()[name = tensor<string, []>("const_34_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8182208)))];
            tensor<fp16, [1, 512, 14, 14]> input_89_cast_fp16 = conv(bias = const_34_to_fp16, dilations = input_87_dilations_0, groups = input_87_groups_0, pad = input_87_pad_0, pad_type = input_87_pad_type_0, strides = input_87_strides_0, weight = const_33_to_fp16, x = input_85_cast_fp16)[name = tensor<string, []>("input_89_cast_fp16")];
            tensor<fp16, [512]> input_91_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_91_alpha_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8183296)))];
            tensor<fp16, [1, 512, 14, 14]> input_91_cast_fp16 = prelu(alpha = input_91_alpha_0_to_fp16, x = input_89_cast_fp16)[name = tensor<string, []>("input_91_cast_fp16")];
            tensor<string, []> input_93_pad_type_0 = const()[name = tensor<string, []>("input_93_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_93_pad_0 = const()[name = tensor<string, []>("input_93_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_93_strides_0 = const()[name = tensor<string, []>("input_93_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_93_dilations_0 = const()[name = tensor<string, []>("input_93_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_93_groups_0 = const()[name = tensor<string, []>("input_93_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 3, 3]> const_35_to_fp16 = const()[name = tensor<string, []>("const_35_to_fp16"), val = tensor<fp16, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8184384)))];
            tensor<fp16, [512]> const_36_to_fp16 = const()[name = tensor<string, []>("const_36_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12903040)))];
            tensor<fp16, [1, 512, 7, 7]> res_13_cast_fp16 = conv(bias = const_36_to_fp16, dilations = input_93_dilations_0, groups = input_93_groups_0, pad = input_93_pad_0, pad_type = input_93_pad_type_0, strides = input_93_strides_0, weight = const_35_to_fp16, x = input_91_cast_fp16)[name = tensor<string, []>("res_13_cast_fp16")];
            tensor<fp16, [1, 512, 7, 7]> input_95_cast_fp16 = add(x = res_13_cast_fp16, y = shortcut_13_cast_fp16)[name = tensor<string, []>("input_95_cast_fp16")];
            tensor<int32, [2]> var_362 = const()[name = tensor<string, []>("op_362"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_363 = const()[name = tensor<string, []>("op_363"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> shortcut_pad_type_0 = const()[name = tensor<string, []>("shortcut_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> shortcut_pad_0 = const()[name = tensor<string, []>("shortcut_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> shortcut_ceil_mode_0 = const()[name = tensor<string, []>("shortcut_ceil_mode_0"), val = tensor<bool, []>(false)];
